/*Напишите программу, которая выводила бы на экран текстовую таблицу (используйте escape-последователь-ности)*/

#include<iostream>
using namespace std;

int main()
{
	cout << "=====================================================================================" << endl;
	cout << "|       X       |        Y       |       X AND Y  |       X OR  Y  |       NOT X    |" << endl;
	cout << "=====================================================================================" << endl;
	cout << "|       0       |        0       |       0        |       0        |       1        |" << endl;
	cout << "|       0       |        1       |       0        |       1        |       1        |" << endl;
	cout << "|       1       |        0       |       0        |       1        |       0        |" << endl;
	cout << "|       1       |        1       |       1        |       1        |       0        |" << endl;
	cout << "=====================================================================================" << endl;

	return 0;
}